tap "kegworks-app/kegworks"

# CLI Tools
brew "azure-cli"
brew "gh"
brew "mas"
brew "neovim"
brew "node"
brew "nvm"
brew "pnpm"
brew "python@3.12"
brew "vercel-cli"
brew "zola"

# Applications
cask "arc"
cask "cleanshot"
cask "cursor"
cask "figma"
cask "ghostty"
cask "github"
cask "kegworks"
cask "notion"
cask "pixelsnap"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "warp"

# Mac App Store
mas "iA Writer", id: 775737590

# VS Code Extensions
vscode "abusaidm.html-snippets"
vscode "achaq.vercel-theme"
vscode "akamud.vscode-theme-onedark"
vscode "alpha4.jsonl"
vscode "anbuselvanrocky.bootstrap5-vscode"
vscode "angelorafael.jsx-html-tags"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "awwit.typed-css-modules-plugin"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "cs50.lab50"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzannotti.vscode-babel-coloring"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "gogocrow.jsx-beautify"
vscode "idered.npm"
vscode "jacano.vscode-pnpm"
vscode "janisdd.vscode-edit-csv"
vscode "khaeransori.json2csv"
vscode "kortina.vscode-markdown-notes"
vscode "mathieusherburne.png-to-ico"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "ricardo-emerson.create-react-tsx-component"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "sidthesloth.html5-boilerplate"
vscode "skyran.js-jsx-snippets"
vscode "styled-components.vscode-styled-components"
vscode "sysoev.language-stylus"
vscode "t-sauer.vscode-babel-repl"
vscode "techer.open-in-browser"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.vscode-typescript-vue-plugin"
vscode "willstakayama.vscode-nextjs-snippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
