
# CLI Tools
brew "azure-cli"
brew "gh"
brew "mas"  # Mac App Store
brew "neovim"
brew "node"
brew "nvm"
brew "pnpm"
brew "python@3.12"
brew "vercel-cli"

# Applications
cask "arc"
cask "cleanshot"
cask "cursor"
cask "figma"
cask "ghostty"
cask "github"
cask "notion"
cask "pixelsnap"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "warp"

# Mac App Store
mas "iA Writer", id: 775737590

# Microsoft Apps (uncomment as needed)
# cask "microsoft-teams"           # Microsoft Teams
# cask "microsoft-outlook"         # Outlook email client
# cask "microsoft-powerpoint"      # PowerPoint


# VS Code Extensions
vscode "achaq.vercel-theme"
vscode "akamud.vscode-theme-onedark"
vscode "alpha4.jsonl"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "awwit.typed-css-modules-plugin"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "cs50.lab50"
vscode "dbaeumer.vscode-eslint"
vscode "dzannotti.vscode-babel-coloring"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "janisdd.vscode-edit-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "prisma.prisma"
vscode "randomfractalsinc.vscode-data-preview"
vscode "ricardo-emerson.create-react-tsx-component"
vscode "rvest.vs-code-prettier-eslint"
vscode "sysoev.language-stylus"
vscode "t-sauer.vscode-babel-repl"
vscode "techer.open-in-browser"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.vscode-typescript-vue-plugin"
vscode "willstakayama.vscode-nextjs-snippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "mattpocock.ts-error-translator"
